results/core6_v1/raw_batch2_20260710/incremental_blocks_6_10/20260711T044145_spike_P30_rep10/k6_stdout.log

     ✓ status 200

     checks.........................: 100.00% 170526 out of 170526
     data_received..................: 39 MB   69 kB/s
     data_sent......................: 18 MB   31 kB/s
     http_req_blocked...............: avg=4.29µs   min=792ns    med=3.41µs   max=34.17ms  p(90)=5.32µs   p(95)=6.3µs   
     http_req_connecting............: avg=354ns    min=0s       med=0s       max=34.1ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=24.38ms  min=69.01µs  med=21.25ms  max=86.86ms  p(90)=54.37ms  p(95)=58.89ms 
       { expected_response:true }...: avg=24.38ms  min=69.01µs  med=21.25ms  max=86.86ms  p(90)=54.37ms  p(95)=58.89ms 
   ✓ http_req_failed................: 0.00%   0 out of 170526
     http_req_receiving.............: avg=334.74µs min=6.6µs    med=154.69µs max=31.19ms  p(90)=743.77µs p(95)=1.01ms  
     http_req_sending...............: avg=10.53µs  min=2.46µs   med=7.65µs   max=1.28ms   p(90)=14.59µs  p(95)=22.86µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=24.03ms  min=0s       med=20.98ms  max=86.82ms  p(90)=53.56ms  p(95)=58.17ms 
     http_reqs......................: 170526  299.168944/s
     iteration_duration.............: avg=125.01ms min=101.77ms med=121.94ms max=187.71ms p(90)=154.91ms p(95)=159.48ms
     iterations.....................: 170526  299.168944/s
     vus............................: 1       min=1                max=100
     vus_max........................: 100     min=100              max=100